title: Detects possibile Log4j Attack
status: stable
description: Detects possibile Log4j Attack defense bypasses
author: Cluster25
date: 2021/12/13
references:
  - internal research
tags:
  - attack.initial_access
logsource:
  category: webserver
detection:
  selection:
    c-uri|re: '(\${upper:[jndildapdnsrmi])?(\${lower:[jndildapdnsrmi])?(\${::\-[jndildapdnsrmi])?((\${env:)(.*)(:-[jndildapdnsrmi]))?'
  condition: selection
falsepositives:
  - Vulnerability Scan
level: high